print("โปรแกรมหาพื้นที่ 3 เหลี่ยม")
a = int(input('ใส่ค่าฐาน'))
b = int(input('ใส่ค่าสูง'))
c = 0.5 * a * b
print(f'ค่าพื้นที่ของ 3 เหลี่ยม = {c}')
print("โปรแกรมหาพื้นที่ 4 เหลี่ยมจัตุรัส")
d = int(input('ใส่ค่าด้าน'))
e = d * d
print(f'ค่าพื้นที่ของ 4 เหลี่ยมจัตุรัส = {e}')
print("โปรแกรมหาพื้นที่ 4 เหลี่ยมผืนผ้า")
f = int(input('ใส่ค่ากว้าง'))
g = int(input('ใส่ค่ายาว'))
h = f * g
print(f'ค่าพื้นที่ของ 4 เหลี่ยมผืนผ้า = {h}')
print("โปรแกรมหาพื้นที่ วงกลม")
i = int(input('ใส่ค่ารัศมี'))
j = 3.14 * i**2
print(f'ค่าพื้นที่ของพื้นที่ วงกลม = {j}')